{
    "Intro": {
        "step": [{
                "text": "Qiqi le tanuki",
                "picture": "Intro1.jpg",
                "music": {
                    "src": "intro.mp3"
                }
            },
            {
                "text": "Il était une fois, un tanuki qui s'appelle Qiqi qui vivait dans la forêt. Il était seul..."
            },
            {
                "text": "Qiqi n'avait ni maison, ni famille. Il l'avait perdu si jeune qu'il ne s'en souvenait pas."
            },
            {
                "text": "Il décida de trouver un lieu où s'installer et essayer de devenir ami avec ses nouveaux voisins.",
                "picture": "Intro2.jpg"
            },
            {
                "text": "Cependant, ses nouveaux voisins n'était pas très contents."
            },
            {
                "text": " Ils ne connaissaient pas Qiqi et se demandaient pourquoi il était venu s'installer ici si soudainement.",
                "picture": "Intro3.jpg"
            },
            {
                "text": "Qiqi le tanuki n'arrivait pas à s'intégrer..."
            },
            {
                "text": "Puis, un jour, les animaux eurent une mauvaise surprise..."
            },
            {
                "text": "Une meute de loups était venue pour les manger.",
                "picture": "Intro4.jpg",
                "music": {
                    "src": "wolf.mp3"
                }
            },
            {
                "text": "C'était la panique, les animaux tentaient de fuir et Qiqi, à l'abri, voulait les aider, mais ne savait pas quoi faire."
            },
            {
                "text": "Qiqi le tanuki avait en revanche un pouvoir très spécial. Il pouvait se changer en ce qu'il souhaitait."
            },
            {
                "text": "Que fait Qiqi le tanuki ?"
            }
        ],
        "choice": [{
                "answer": "Il se transforme en loup.",
                "route": "A"
            },
            {
                "answer": "Il se transforme en oiseau.",
                "route": "F1"
            },
            {
                "answer": "Il ne se transforme pas.",
                "route": "Good End"
            }
        ]
    },
    "A": {
        "step": [{
                "text": "Qiqi le tanuki décida de se transformer en loup.",
                "picture": "A1.jpg"
            },
            {
                "text": "Il s'attaqua alors aux loups qui ne comprenaient pas ce qu'il se passait."
            },
            {
                "text": "Les loups, stupéfaits d'être attaqués par un de leurs semblables pendant leur chasse, décidèrent de battre en retraite."
            },
            {
                "text": "Qiqi était ainsi parvenu à sauver plusieurs de ses voisins.",
                "music": {
                    "function": "pause"
                }
            },
            {
                "text": "Qiqi pensait enfin pouvoir être accepté par ses voisins."
            },
            {
                "text": "Mais ce qu'ils avaient retenus, c'était surtout que Qiqi avait pris l'apparence d'un loup.",
                "picture": "A2.jpg",
                "music": {
                    "src": "A.mp3"
                }
            },
            {
                "text": "Ils décidèrent de chasser Qiqi le tanuki."
            },
            {
                "text": "Qiqi le tanuki ne savait pas où aller. Il avança dans la forêt à la recherche d'un nouvel abri."
            },
            {
                "text": "Il finit par sortir de la forêt et se retrouva devant une ferme dans laquelle se trouvait un groupe de poules.",
                "picture": "A3.jpg",
                "music": {
                    "src": "A2.mp3"
                }
            },
            {
                "text": "Qiqi était affamé. Que fait Qiqi le tanuki ?"
            }
        ],
        "choice": [{
                "answer": "Il se transforme en loup.",
                "route": "F2"
            },
            {
                "answer": "Il se transforme en coq.",
                "route": "F3"
            },
            {
                "answer": "Il ne se transforme pas.",
                "route": "A+"
            }
        ]
    },
    "A+": {
        "step": [{
                "text": "Une poule paniquée l'aperçut et lui sauta dessus pour lui demander de l'aide. Elle avait perdu ses petits dans la forêt.",
                "picture": "A+1.jpg"
            },
            {
                "text": "Qiqi le tanuki était tout heureux de voir que quelqu'un avait besoin de son aide. Il accepta avec joie et retourna dans la forêt."
            },
            {
                "text": "Mais après quelques heures de recherche, Qiqi le tanuki était fatigué et de plus en plus affamé.",
                "picture": "A+2.jpg"
            },
            {
                "text": "Soudain, il attendit des hurlements!",
                "music": {
                    "src": "wolf.mp3"
                }
            },
            {
                "text": "C'était les loups! Le même groupe de loups qu'il avait affronter précédemment.",
                "picture": "A+3.jpg"
            },
            {
                "text": "Ils ont trouvé les poussins avant lui et les pourchassaient."
            },
            {
                "text": "Qiqi le tanuki devait faire quelque chose!"
            },
            {
                "text": "Que fait Qiqi le tanuki ?"
            }
        ],
        "choice": [{
                "answer": "Il se transforme en loup.",
                "route": "F4"
            },
            {
                "answer": "Il ne se transforme pas.",
                "route": "F5"
            }
        ]
    },
    "Good End": {
        "step": [{
                "text": "Qiqi le tanuki décida de ne pas se transformer. Il sortit de sa cachette pour aider ses voisins.",
                "picture": "GE-1.jpg",
                "music": {
                    "src": "hero.mp3"
                }
            },
            {
                "text": "Mais il était évident que Qiqi le tanuki était trop faible pour vaincre tous ces loups."
            },
            {
                "text": "Guidés par le courage de Qiqi le tanuki, tous les animaux se retournèrent pour se battre."
            },
            {
                "text": "Submergés par leur combativité, les loups décidèrent de battre en retraite."
            },
            {
                "text": "C'est ainsi que Qiqi le tanuki devint un héros adoré par tous ses voisins. Fin.",
                "picture": "GE-2.jpg",
                "music": {
                    "src": "victory.mp3"
                }
            }
        ],
        "choice": [{
            "answer": "Recommencer?",
            "route": "Intro"
        }]
    },
    "F1": {
        "step": [{
                "text": "Le tanuki se changea en oiseau. Il voulait aider les autres animaux.",
                "picture": "F1-1.jpg"
            },
            {
                "text": "Il voulait attirer l'attention des loups. Malheureusement, le tanuki n'avait jamais voler auparavant."
            },
            {
                "text": "Il s'écrasa sur le sol et ne pouvait plus bouger."
            },
            {
                "text": "Un loup en profita pour le manger."
            },
            {
                "text": "Grâce à l'acte de Qiqi l'oiseau, certains animaux réussirent à s'enfuir et à survivre. Fin."
            }
        ],
        "choice": [{
            "answer": "Recommencer?",
            "route": "Intro"
        }]
    },
    "F2": {
        "step": [{
                "text": "Qiqi le tanuki décida de se transformer en loup...",
                "picture": "F2-1.jpg",
                "music": {
                    "src": "madqiqi.mp3"
                }
            },
            {
                "text": "Guidé par son estomac, il se mit à dévorer tous les poulets qui croisait son regard."
            },
            {
                "text": "Mais rapidement, le propriétaire des lieux débarqua un fusil à la main et mit fin à la folie de Qiqi.",
                "picture": "F2-2.jpg"
            },
            {
                "text": "C'est ainsi que mourru Qiqi le loup... Fin."
            }
        ],
        "choice": [{
            "answer": "Recommencer?",
            "route": "Intro"
        }]
    },
    "F3": {
        "step": [{
                "text": "Qiqi décida de se transformer en coq pour s'intégrer à la communauté.",
                "picture": "F3-1.jpg",
                "music": {
                    "src": "chicken.mp3"
                }
            },
            {
                "text": "Soudain, un autre coq apparu pour le défier. Le gagnant aura le droit de manger en premier."
            },
            {
                "text": "Qiqi, affamé, se battit de toute ses forces et grâce à la force de la faim remporta le combat.",
                "picture": "F3-2.jpg"
            },
            {
                "text": "Et Qiqi le coq devint le roi de la ferme. Fin."
            }
        ],
        "choice": [{
            "answer": "Recommencer?",
            "route": "Intro"
        }]
    },
    "F4": {
        "step": [{
                "text": "Qiqi décida de se transformer en loup.",
                "music": {
                    "src": "madqiqi.mp3"
                },
                "picture": "F4-1.jpg"
            },
            {
                "text": "Mais il était affamé, il ne pensait plus qu'à manger."
            },
            {
                "text": "Il aida les loups à coincer les poussins et il partagèrent le repas."
            },
            {
                "text": "Au cours du repas, Qiqi se lia d'amitié avec les autres loups qui l'acceptèrent au sein de la meute.",
                "picture": "F4-2.jpg",
                "music": {
                    "src": "A.mp3"
                }
            },
            {
                "text": "Ainsi, Qiqi le loup avait trouvé une nouvelle famille. Fin."
            }
        ],
        "choice": [{
            "answer": "Recommencer?",
            "route": "Intro"
        }]
    },
    "F5": {
        "step": [{
                "text": "Qiqi décida de ne pas se transformer.",
                "picture": "F5-1.jpg"
            },
            {
                "text": "Qiqi prit son courage à 2 pattes et se mit en travers du chemin des loups."
            },
            {
                "text": "Malheureusement, il était évident que Qiqi le tanuki ne faisait pas le poids."
            },
            {
                "text": "Les loups le tuèrent et le mangèrent."
            },
            {
                "text": " Mais grâce à son courage, les poussins réussirent à s'échapper et purent compter la bravoure de Qiqi le tanuki. Fin.",
                "picture": "F5-2.jpg"
            }
        ],
        "choice": [{
            "answer": "Recommencer?",
            "route": "Intro"
        }]
    }
}